# 4. [БРОЈЕВИ] Анђа пише на папир бројеве од m до n тако да сваки број k (за који важи m ≤ k ≤ n) понови k
# пута. Напиши програм који за унете m и n (1 ≤ m ≤ n ≤ 100, сваки у посебном реду) исписује све бројеве које је
# Анђа записала (иза сваког броја исписати по један размак).
# Улаз Излаз
# 3    3 3 3 4 4 4 4 5 5 5 5 5
# 5

m = int(input())
n = int(input())

andjini_brojevi = []
i = 0
for k in range(m,n + 1):
    for i in range(k):
        andjini_brojevi.append(k)
        i += 1
print(andjini_brojevi)

    